// constants/car_data.dart

class CarData {
  // قوائم الـ Tags
  static const List<String> tags = ["صغيره", "كبيره", "بيكأب", "باص"];
  
  static const List<String> tagImages = [
    'img/sedan.png', 
    'img/crossover.png', 
    'img/pickup.png', 
    'img/bus.png'
  ];

  // المدن السودانية
  static const List<String> sudanCities = [
    "الخرطوم",
    " الخرطوم - أم درمان",
    "الخرطوم - بحري",
    "بورتسودان",
    "ود مدني",
    "كسلا",
    "الأبيض",
    "القضارف",
    "عطبرة",
    "سنار",
    "كادوقلي",
    "الدمازين",
    "دنقلا",
    "نيالا",
    "الفاشر",
    "زالنجي",
    "كوستي",
    "ربك",
    "وادي حلفا",
    "حلفا الجديدة",
    "سواكن",
    "الدامر",
    "الرهد",
    "الجنينة",
  ];

  // أنواع السيارات
  static const List<String> carTypes = [
    "أستون مارتن",
    "ألفا روميو",
    "إنفينيتي",
    "أودي",
    "بي إم دبليو",
    "بيجو",
    "بورش",
    "بوجاتي",
    "بوغاتي",
    "بويك",
    "تاتا",
    "تسلا",
    "تويوتا",
    "جي إم سي",
    "جيلي",
    "جاكوار",
    "جينيسيس",
    "دايهاتسو",
    "دودج",
    "دي إس",
    "دونغفينغ",
    "رام",
    "رينو",
    "سيتروين",
    "سوبارو",
    "سوزوكي",
    "شيري",
    "شيفروليه",
    "شانجان",
    "فاو",
    "فورد",
    "فيراري",
    "فولفو",
    "فولكس فاجن",
    "كاديلاك",
    "كيا",
    "كوينيجسيج",
    "لاند روفر",
    "لكزس",
    "لامبورغيني",
    "لينكولن",
    "لوتس",
    "مازدا",
    "مازيراتي",
    "ماهيندرا",
    "مايباخ",
    "ميتسوبيشي",
    "ميني",
    "مرسيدس",
    "نيسان",
    "هافال",
    "هوندا",
    "هيونداي",
  ];

  // ألوان السيارات
  static const List<String> carColors = [
    "أبيض",
    "أسود",
    "فضي",
    "رمادي",
    "أزرق",
    "أحمر",
    "أخضر",
    "ذهبي",
    "برتقالي",
    "بني",
    "أرجواني",
    "زهري",
  ];

  // دالة لإنشاء قائمة موديلات السيارات
  static List<String> generateCarModels({int startYear = 1990, int endYear = 2025}) {
    return List.generate(
      endYear - startYear + 1, 
      (index) => (endYear - index).toString()
    );
  }
}